Repository: murank/wxwidgetsjp
Catalog: wxwidgetsjp-level2.tmx
Source language: en_us
Languages: ja

source: Each represents either a certain way to lay out dialog items in a dialog or it fulfills a special task such as wrapping a static box around a dialog item (or another sizer).
ja: それぞれ、特定の方法でダイアログ内にコントロールを配置したり、コントロール (や他のサイザー) をスタティックボックスで囲むといった特別な処理を行ったりします。

source: Either the number of columns or the number or rows is fixed and the grid sizer will grow in the respectively other orientation if new children are added:
ja: 列数か行数のどちらかは固定で、新しい子コントロールが追加されるとグリッドサイザーはもう一方の方向に伸びます:

source: Enables or disables the event handler.
ja: イベントハンドラを有効化、無効化します。

source: Ends a modal dialog, passing a value to be returned from the ShowModal() invocation.
ja: ShowModal() の戻り値を指定してモーダルダイアログを終了します。

source: Environment Variables
ja: 環境変数

source: Even better, use the same XPMs on all platforms.
ja: もっと良い方法はすべてのプラットフォームで同じ XPM を使用することです。

source: Even despite caching the index, indexed access should be replaced with sequential access using string iterators.
ja: インデックスのキャッシュを持つとはいえ、インデックスアクセスはイテレータを使った逐次アクセスに置き換えるべきです。

source: Even sending Unicode data from one Unicode-aware system to another may need encoding to an 8-bit multibyte encoding (UTF-7 or UTF-8 is typically used for this purpose), to pass unhindered through any traditional transport channels.
ja: Unicode を意識したシステムから別のシステムへ Unicode データを送信するときでさえ、昔ながらの転送チャネル経由で制約を受けずにやり取りするために 8 ビットのマルチバイトエンコーディング (この目的には一般的に UTF-7 か UTF-8 が使用されます) に符号化する必要があります。

source: Even though wxWidgets always uses Unicode internally, not all the other libraries and programs do and even those that do use Unicode may use a different encoding of it.
ja: wxWidgets が常に内部で Unicode を使うとはいえ、他のすべてのライブラリやプログラムが Unicode を使っているとは限りませんし、Unicode を使っていたとしても、別のエンコーディングを使用しているかもしれません。

source: Event Handlers Chain
ja: イベントハンドラの連鎖

source: Event Handlers vs Virtual Methods
ja: イベントハンドラ vs 仮想関数

source: Event Handling
ja: イベント処理

source: Event Handling with Event Tables
ja: イベントテーブルによるイベント処理

source: Event handlers can be bound at any moment.
ja: イベントハンドラは任意のタイミングでバインドできます。

source: Events and Event Handling
ja: イベントとイベント処理

source: Events of different types can use the same event class, for example both button click and listbox selection events use wxCommandEvent class (as do all the other simple control events), but the key press event uses wxKeyEvent as the information associated with it is different.
ja: 同じイベントクラスを別のイベント型に使用することができます。例えば、ボタンのクリックイベントとリストボックスの選択イベントは両方とも wxCommandEvent クラスを使用しています (し、他のすべての単純なコントロールイベントも同じものを使用しています) が、キー押下イベントはイベントに関連する情報が異なるため、wxKeyEvent を使用しています。

source: Events that have a higher level of meaning and/or are generated by the window itself, (button click, menu select, tree expand, etc.) are command events and are sent up to the parent to see if it is interested in the event.
ja: (ボタンクリック、メニュー選択、ツリーの展開といった) 高水準で、ウィンドウ自身が生成するイベントはコマンドイベントと呼ばれ、そのイベントを処理対象とする場合に親コントロールに対して送られます。

source: Events that have a higher level of meaning or are generated by the window itself (button click, menu select, tree expand, etc.) are command events and are sent up to the parent to see if it is interested in the event.
ja: (ボタンクリック、メニュー選択、ツリーの展開といった) 高水準で、ウィンドウ自身が生成するイベントはコマンドイベントと呼ばれ、そのイベントを処理対象とする場合に親コントロールに対して送られます。

source: Example
ja: 例

source: Example 1: Constructing a wxString from input in current encoding.
ja: 例 1: 現在のエンコーディングの入力から wxString を構築する。

source: Example 2: Input in UTF-8 encoding.
ja: 例 2: UTF-8 の入力。

source: Example 3: Input in KOI8-R.
ja: 例 3: KOI8-R の入力。

source: Example 4: Printing a wxString to stdout in UTF-8 encoding.
ja: 例 4: wxString を標準出力へ UTF-8 で出力する。

source: Example 5: Printing a wxString to stdout in custom encoding.
ja: 例 5: wxString を標準出力へ任意のエンコーディングで出力する

source: Example:
ja: 例:

source: Exiting the Application Gracefully
ja: 正しいアプリケーションの終了方法

source: Explicit conversion to C string in the internal representation (either wchar_t* or UTF-8-encoded char...
ja: C 文字列を明示的に内部表現 (ビルドに応じて wchar_t* もしくは UTF-8 でエンコードされた char* のいずれか) へ変換します。

source: Extra functionality is automatically given to the dialog box, such as tabbing between items (currently Windows only).
ja: コントロール間のタブ遷移など、自動的に追加の機能が付与される。(Windows のみ)

source: Extracting the strings to be translated from the program: this uses the work done in the previous step because xgettext program used for string extraction recognises the standard _() as well as (using its -k option) our wxGetTranslation and extracts all strings inside the calls to these functions.
ja: 翻訳対象の文字列をプログラム中から抽出する: これには前のステップで行った作業の結果を利用します。なぜなら、文字列の抽出に使用する xgettext プログラムが標準的な _() や (-k オプションを使用することで) wxGetTranslation を識別し、それらの中にある文字列をすべて抽出してくれるためです。

source: File Classes and Functions
ja: ファイルクラスと関数

source: Files
ja: ファイル

source: Final word of caution: most of these functions may return either directly the pointer to internal string buffer or a temporary wxCharBuffer or wxWCharBuffer object.
ja: 最後の注意点です: これらの関数の大半は内部文字列のポインタを直接返却するか、一時的な wxCharBuffer または wxWCharBuffer のオブジェクトを返却します。

source: Finally note that wxString uses the current locale encoding to convert any C string literal to Unicode.
ja: 最後に、C リテラル文字列を Unicode へ変換するために wxString では現在のロケールを使用します。

source: Finally notice that writing
ja: 最後の注意点として、次のように書くと

source: Finally, wxString::ToUTF8() and wxString::wc_str() functions never fail and always return a pointer to char string containing the UTF-8 representation of the string or wchar_t string.
ja: 最後に、wxString::ToUTF8() 関数と wxString::wc_str() 関数は絶対に失敗せず、UTF-8 で表現された char 文字列や wchar_t 文字列のポインタを常に返却します。

source: Finally, ProcessEvent is called on the wxApp object.
ja: 最後に、wxApp オブジェクトの ProcessEvent が呼ばれます。

source: Finally, a few structure fields, notable wxCmdLineEntryDesc::shortName, longName and description fields have been changed to be of type const char* instead of const wxChar* so you will need to remove wxT() or _T() if you used it with their initializers.
ja: 最後に、いくつかの構造体のフィールド、特に wxCmdLineEntryDesc::shortName、longName、 description フィールドの型が const wxChar* から const char* に変更されました。そのため、それらのフィールドの初期化に wxT() や _T() を使用している場合、それらを取り除く必要があります。

source: Finally, i.e., if the event is still not processed, the wxApp object itself (which derives from wxEvtHandler) gets a last chance to process it.
ja: 最後に、つまり、イベントがまだ処理されていないときに、(wxEvtHandler を継承している) wxApp オブジェクト自身でイベントが処理されます。

source: Finally, if even more control over the output format is needed, then DoLogRecord() can be overridden as it allows to construct custom messages depending on the log level or even do completely different things depending on the message severity (for example, throw away all messages except warnings and errors, show warnings on the screen and forward the error messages to the user's (or programmer's) cell phone -- maybe depending on whether the timestamp tells us if it is day or night in the current time zone).
ja: 最後に、出力形式をさらに制御する必要がある場合、DoLogRecord() をオーバーライドすることでログレベルに応じてカスタムメッセージを構築したり、メッセージの重要度に応じてまったく別のことを行なうことさえできます。(例えば警告とエラー以外のメッセージを破棄し、警告は画面に表示して、エラーメッセージはユーザ (もしくはプログラマ) の携帯電話へ転送するなどです。ただ、これは現在のタイムゾーンにおいて昼か夜かがタイムスタンプで分かるかどうかによりますが)

source: Finally, if you don't like using macros for static initialization of the event tables you may also use wxEvtHandler::Connect to connect the events to the handlers dynamically, during run-time.
ja: 最後に、マクロを使ってイベントテーブルを静的に初期化したくない場合、wxEvtHandler::Connect を使用して動的に (実行時に) イベントとイベントハンドラを接続することもできます。

source: Finally, it is enough to override wxLog::DoLogText() if you only want to redirect the log messages and the destination doesn't depend on the message log level.
ja: 最後に、メッセージのログレベルに関係なく、ログメッセージをリダイレクトしたいだけの場合、wxLog::DoLogText() をオーバーライドすれば充分です。

source: Finally, note that the type used by wxString to store Unicode code units (wchar_t or char) is always typedef-ined to be wxStringCharType.
ja: 最後に、Unicode コード単位を格納するために wxString で使用される型 (wchar_t または char) は常に wxStringCharType として typedef されます。

source: Finally, take a look at the i18n sample which shows you how all this looks in practice.
ja: 最後に、国際化を実際にどういう風に行うのかを示す例として i18n サンプル を参照してください。

source: Finally, the most widespread encoding used for the external Unicode storage (e.g. files and network protocols) is UTF-8 which is byte-oriented and so avoids the endianness ambiguities of UTF-16 and UTF-32.
ja: 最後に、Unicode を外部記憶装置 (ファイルやネットワークプロトコルなど) へ格納する際に一番広く使われているのが UTF-8 です。これはバイト指向のエンコーディングであるため、 UTF-16 や UTF-32 のようにエンディアンの曖昧さがありません。

source: Finally, there is a special wxT() macro which should enclose all literal strings in the program.
ja: 最後に、プログラム中のリテラル文字列を囲む、特別な wxT() マクロがあります。

source: Finally, there is also a possibility to redirect the output sent to cout to a wxTextCtrl by using the wxStreamToTextRedirector class.
ja: 最後に、wxStreamToTextRedirector クラスを使用することで cout へ出力した内容を wxTextCtrl にリダイレクトすることもできます。

source: Finally, there is another additional complication (which, in fact, simplifies life of wxWidgets programmers significantly): when propagating the command events up to the parent window, the event propagation stops when it reaches the parent dialog, if any.
ja: 最後に、他にも複雑な仕組みがあります (実際には、これは wxWidgets プログラマの生活を非常にシンプルにしてくれるものです): コマンドイベントが親ウィンドウへ伝播するとき、親ダイアログまで到達した時点で伝播が終了します。

source: Finally, there is another additional complication (which, in fact, simplifies life of wxWidgets programmers significantly): when propagating the command events upwards to the parent window, the event propagation stops when it reaches the parent dialog, if any.
ja: 最後に、他にも複雑な仕組みがあります (実際には、これは wxWidgets プログラマの生活を非常にシンプルにしてくれるものです): コマンドイベントが親ウィンドウへ伝播するとき、親ダイアログまで到達した時点で伝播が終了します。

source: Finally, you can allocate identifiers dynamically using wxNewId() function too.
ja: 最後に、wxNewId() を使用して動的に識別子を割り当てることもできます。

source: Finally, you need to implement the event handlers.
ja: 最後に、イベントハンドラを実装する必要があります。

source: Finally, you will need to generate and post your custom events.
ja: 最後に、カスタムイベントを生成し、送信する必要があります。

source: First define one or more event handlers.
ja: 最初に、ひとつ以上の イベントハンドラ を定義してください。

source: First of all, each character in an Unicode program takes 2 bytes instead of usual one, so another type should be used to store the characters (char only holds 1 byte usually).
ja: 最初に、プログラム中の文字について、通常であれば 1 文字あたり 1 バイトですが、Unicode プログラムの場合 2 バイトを消費するため、文字を格納するために別の型を使用する必要があります。 (char 型は通常 1 バイトしか保持できません)

source: First of all, no knowledge of wxLog classes is needed to use them.
ja: まず最初に、wxLog クラス郡を使用するのにその知識は必要とされません。

source: First of all, you see that there are no more #ifdefs at all.
ja: 最初に、#ifdef がまったくないことが分かると思います。

source: First of them is in the call to the printf() function.
ja: 最初のバグは printf() 関数の呼び出し部分に存在します。

source: Font Mapping
ja: フォントマッピング

source: Font encodings.
ja: フォントエンコーディング。

source: Font mapping
ja: フォントマッピング

source: For wxFrame, the client size also excludes the frame menu, tool and status bars, if any.
ja: wxFrame の場合、クライアントサイズにはフレームメニュー、ツールバー、ステータスバーも含まれません。

source: For a set of dialog convenience functions, including file selection, see Dialog functions.
ja: ファイルの選択を含む、ダイアログの便利関数は ダイアログ関数 を参照してください。

source: For a set of dialog convenience functions, including file selection, see Dialogs.
ja: ファイルの選択を含む、ダイアログの便利関数は ダイアログ を参照してください。

source: For all normal, informational messages.
ja: すべての通常 (通知) メッセージ用。

source: For an example implementation, see the valtext.h and valtext.cpp files in the wxWidgets library.
ja: 実装の例は wxWidgets ライブラリの valtext.h と valtext.cpp を参照してください。

source: For communication between secondary threads and the main thread, you may use wxEvtHandler::AddPendingEvent or its short version wxPostEvent.
ja: メインスレッドとサブスレッドとの通信には wxEvtHandler::AddPendingEvent か、もしくはその短縮版である wxPostEvent を使用します。

source: For communication between secondary threads and the main thread, you may use wxEvtHandler::QueueEvent or its short version wxQueueEvent.
ja: メインスレッドとサブスレッドとの通信には wxEvtHandler::QueueEvent か、もしくはその短縮版である wxQueueEvent を使用します。

source: For consistency, continue to use the wxWindow::Destroy function instead of the delete operator when deleting these kinds of windows explicitly.
ja: 一貫性を保つために、これらの種類のウィンドウを明示的に削除するときは delete 演算子の代わりに引き続き wxWindow::Destroy 関数を使用してください。

source: For definitions of code units and code points terms, please see the Unicode Representations and Terminology paragraph.
ja: コード単位 と コードポイント の定義については Unicode 表現と用語 の段落を参照してください。

source: For example a wxListBox's best size will be calculated based on how many items it has, up to a certain limit, or a wxButton's best size will be calculated based on its label size, but normally won't be smaller than the platform default button size (unless a style flag overrides that).
ja: 例えば wxListBox の最適サイズは特定の上限までの間でアイテム数に応じて計算されます。また、wxButton の最適サイズはラベルのサイズに応じて計算されますが、(スタイルフラグで上書きしない限り) 通常はプラットフォームのデフォルトのボタンサイズより小さくなることはありません。

source: For example a typical loop:
ja: 例えば典型的なループである、

source: For example it is possible to filter out a number of key events sent by the system to a native text control by overriding wxTextCtrl and defining a handler for key events using EVT_KEY_DOWN.
ja: 例えば、ネイティブテキストコントロールに送られるキーイベントをフィルタリングする場合、wxTextCtrl をオーバーライドし、EVT_KEY_DOWN を使用してキーイベントハンドラを定義することで実現できます。

source: For example,
ja: 以下に例を示します。

source: For example, a function to get the length of a wide-character string is called wcslen() (compare with strlen() - you see that the only difference is that the "str" prefix standing for "string" has been replaced with "wcs" standing for "wide-character string").
ja: 例えば、ワイド文字列の長さを取得する関数は wcslen() と呼ばれます。(strlen() と比べると、違いは "string" を表す接頭語 "str" が "wide-character string" を表す "wcs" に変わっているだけであることが分かると思います)

source: For example, clicking on a button, selecting an item from a list box and pressing a key on the keyboard all generate events with different event types.
ja: 例えば、ボタンクリック、リストボックスの選択、キー押下はすべて別々のイベント型のイベントを生成します。

source: For example, if a widget's min size is set to (150, -1) and the best size is (80, 22) then the best fitting size is (150, 22).
ja: 例えば、ウィジェットの最小サイズが (150, -1)、最適サイズが (80, 22) の場合、最適フィットサイズは (150, 22) になります。

source: For example, if the standard font as well as the overall design of Linux/GTK widgets requires more space than on Windows, the initial dialog size will automatically be bigger on Linux/GTK than on Windows.
ja: 例えば、標準フォントが Linux/GTK ウィジェット全体のデザインと同じように Windows の場合より多くのスペースを必要とする場合、ダイアログの初期サイズは Windows より Linux/GTK の方が自動的に大きくなります。

source: For example, it's possible to do some initialization first and only bind the handlers if and when it succeeds.
ja: 例えば、先に何かの初期化処理を行い、それが成功したときにのみ、イベントハンドラをバインドすることも可能です。

source: For example, only error messages, or only error messages and warnings might be logged, filtering out all informational messages.
ja: 例えば、すべての通知メッセージをフィルタリングして、エラーメッセージのみ、もしくはエラーメッセージと警告メッセージのみを記録しても構いません。

source: For example, the operator[] doesn't return neither a char nor a wchar_t but an object of a helper class wxUniChar or wxUniCharRef which is implicitly convertible to either.
ja: 例えば、[] 演算子 が返却する型は char でもwchar_t でもなく、どちらの型にも変換可能なヘルパークラスである wxUniChar か wxUniCharRef です。

source: For example, the notorious (due to the confusion they created) macros wxT() and _T() are not needed at all any longer.
ja: 例えば、(何を作成するのか分かりづらいことで) 悪名高い wxT() マクロと _T() マクロはもはや完全に不要になりました。

source: For example, this code may crash:
ja: 例えば、このコードはクラッシュするでしょう:

source: For example, wxZLibInputStream is an inline stream decompressor.
ja: 例えば、wxZLibInputStream はインラインでストリームを展開します。

source: For example, you could define a class inheriting from wxLog which shows all the log messages in some part of your main application window reserved for the message output without interrupting the user work flow with modal message boxes.
ja: 例えば、モーダルメッセージボックスでユーザの操作を妨げないようにするため、メインウィンドウの一部にすべてのログメッセージを表示するように wxLog を継承したクラスを定義することができます。

source: For example, you may wish to check that all files have been saved.
ja: 例えば、すべてのファイルが保存されているか確認したいと思うかもしれません。

source: For example, you might want to invoke a dialog editor in your application that changes aspects of dialog boxes.
ja: 例えば、ダイアログの外見を変更するためのダイアログエディタをアプリケーション内で起動したいと思うかもしれません。

source: For example:
ja: 以下に例を示します:

source: For handling binary data you may also want to look at the wxStreamBuffer, wxMemoryOutputStream, wxMemoryInputStream classes.
ja: バイナリデータを扱うために wxStreamBuffer、wxMemoryOutputStream、wxMemoryInputStream についても参照したいと思うことでしょう。

source: For information about the new wxWidgets resource system, which can describe sizer-based dialogs, see the XML-based resource system overview.
ja: サイザーに基づいたダイアログを作成可能な wxWidgets の新しいリソースシステムについての情報は XML に基づくリソースシステムの概要 を参照してください。

source: For information about the wxWidgets resource system, which can describe sizer-based dialogs, see the XML Based Resource System (XRC).
ja: サイザーに基づいたダイアログを作成可能な wxWidgets のリソースシステムについての情報は XML に基づくリソースシステム (XRC) を参照してください。

source: For instance, it is not recommended to use the Windows registry for amounts of data more than a couple of kilobytes.
ja: 例えば、Windows のレジストリに数キロバイト以上のデータを格納することは推奨されていません。

source: For menu commands and most control commands (such as button presses), wxCommandEvent is used.
ja: メニューコマンドと (ボタン押下といった) 大半のコマンドコントロールでは wxCommandEvent が使用されます。

source: For more detailed information on how to use sizers programmatically, please refer to the section Programming with Sizers.
ja: サイザーをプログラムで使用する方法については サイザーを用いたプログラミング を参照してください。

source: For more detailed information on how to use sizers programmatically, please refer to the section Programming with wxBoxSizer.
ja: サイザーをプログラムで使用する方法については サイザーを用いたプログラミング を参照してください。

source: For more info about how wxString works, please see the wxString Overview.
ja: wxString の挙動についての詳細は wxString の概要 を参照してください。

source: For more information about converters and Unicode see the wxMBConv classes overview.
ja: Unicode の変換についての詳細は wxMBConv クラスの概要 を参照してください。

source: For more information, please see Programming with wxBoxSizer.
ja: より詳しい情報は wxBoxSizer を用いたプログラミング を参照してください。

source: For posting events to a certain event handler there are two possibilities: using wxEvtHandler::AddPendingEvent or using wxEvtHandler::QueueEvent.
ja: 特定のイベントハンドラへイベントを送信する方法は 2 種類あります: wxEvtHandler::AddPendingEvent を使用する方法と wxEvtHandler::QueueEvent を使用する方法です。

source: For programming information, see wxGridSizer.
ja: プログラミングに関する情報は wxGridSizer を参照してください。

source: For simplicity of implementation, wxString when wxUSE_UNICODE_WCHAR==1 (e.g. on Windows) uses per code unit indexing instead of per code point indexing and doesn't know anything about surrogate pairs; in other words it always considers code points to be composed by 1 code unit, while this is really true only for characters in the BMP (Basic Multilingual Plane).
ja: 実装を単純にするため、wxUSE_UNICODE_WCHAR==1 のとき (例えば Windows) の wxString では コードポイントごとのインデックス の代わりに コード単位ごとのインデックス を使用し、サロゲートペアについては考慮しません; つまり、コードポイントは常に 1 コード単位に格納されているものと仮定するということですが、これは BMP (基本多言語面) の文字にしか当てはまりません。

source: For size events, wxSizeEvent is used.
ja: リサイズイベントでは wxSizeEvent が使用されます。

source: For the full list of event classes, please see the event classes group page.
ja: イベントクラスの完全な一覧は イベントクラスグループ を参照してください。

source: For the performance reasons wxString doesn't allocate exactly the amount of memory needed for each string.
ja: 性能上の理由から、wxString は各文字列で必要とされる量ちょうどのメモリを割り当てません。

source: For the window styles specific to each window class, please see the documentation for the window.
ja: 各ウィンドウクラス独自のウィンドウスタイルについては、そのウィンドウのドキュメントを参照してください。

source: For this conversion, the wxConvLibc class instance is used.
ja: この変換では wxConvLibc クラスのインスタンスが使用されます。

source: For this purpose, a stretch factor may be assigned to each child, where the default value of 0 indicates that the child will not get more space than its requested minimum size.
ja: このため、子コントロールに対してストレッチ係数を割り当てます。ストレッチ係数のデフォルト値は 0 で、これは必要とする最小サイズ以上のスペースを取得しないことを表します。

source: For this reason, it's preferable to override DoGetBestClientSize() and let DoGetBestSize() compute the full best size.
ja: このため、DoGetBestClientSize() をオーバーライドする方がより望ましく、それに基づいて DoGetBestSize() が全体の最適サイズを計算するようにしてください。

source: For this the wxLogChain and wxLogPassThrough can be used.
ja: このために wxLogChain と wxLogPassThrough を使用できます。

source: For this the wxLogChain, wxLogInterposer, and wxLogInterposerTemp can be used.
ja: このために wxLogChain、wxLogInterposer、wxLogInterposerTemp を使用できます。

source: For this, a wxDataObject must be associated with the drop target and this data object will be responsible for the format negotiation between the drag source and the drop target.
ja: このため、wxDataObject はドロップ先に関連付けられている必要があり、このデータオブジェクトはドラッグ元とドラッグ先で調整したフォーマットに従ったものになります。

source: For this, you should only know about wxLogXXX() functions.
ja: そのため、wxLogXXX() 関数 についてのみ、知っておく必要があります。

source: For validators to work correctly, validator functions must be called at the right times during dialog initialisation and dismissal.
ja: バリデータが正しく動作するためにはダイアログの初期化時、および終了時の適切なタイミングでバリデータ関数を呼ぶ必要があります。

source: For verbose output.
ja: 詳細な出力用。

source: For warnings - they are also normally shown to the user, but don't interrupt the program work...
ja: 警告メッセージ (通常はユーザに通知されますが、プログラムの動作を妨げないメッセージ) 用。

source: Freezes the window or, in other words, prevents any updates from taking place on screen, the window is not redrawn at all.
ja: ウィンドウをフリーズ、つまり、画面上のいかなる更新も行われないようにします。これを行なうとウィンドウはまったく再描画されなくなります。

source: From a practical point of view, using Unicode is almost a requirement when writing applications for international audience.
ja: 実用的な観点から見ると、世界中の人に向けてアプリケーションを書く時には Unicode の使用がほぼ必須と言えます。

source: From another point of view, they provide an interface which hides the differences between the Windows registry and the standard Unix text format configuration files.
ja: 別の見方をすれば、これらのクラスは Windows のレジストリと Unix のテキスト形式の設定ファイルの差異を隠蔽するインタフェースを提供しています。

source: From wxWidgets 2.0, event tables are used instead, with a few exceptions.
ja: wxWidgets 2.0 からは一部の例外を除き、代わりに イベントテーブル が使用されています。

source: Function which must be overridden to implement the size available for the scroll target for the given...
ja: 指定されたメインウィンドウのサイズに対して、スクロール対象が使用可能なサイズを計算するために必ずオーバーライドする必要がある関数。

source: Functions related to sizing
ja: サイズ関連の関数

source: Functions: see Files and Directories.
ja: 関数: ファイルとディレクトリ を参照してください。

source: Functions: see file functions.
ja: 関数: ファイル関数 を参照してください。

source: Further details (including how to read/write these entries) may be found in the documentation for wxConfigBase.
ja: (エントリの読み書きの仕方を含む) より詳しい情報は wxConfigBase のドキュメントにあります。

source: GTK 2.0 only accepts UTF-8 strings.
ja: GTK 2.0 は UTF-8 文字列のみを受け付けます。

source: General approach
ja: 一般的なアプローチ

source: Generally speaking you should only use non-default UTF-8 build in specific circumstances e.g. building for resource-constrained systems where the overhead of conversions (and also reduced memory usage of UTF-8 compared to UTF-32 for the European languages) can be important.
ja: 一般的に言うと、リソースが限られており、変換にかかるオーバーヘッド (と、ヨーロッパ言語において UTF-32 の代わりに UTF-8 を使用することによるメモリ消費量の削減) が重要となる、といった特殊な状況下でのみ、非標準の UTF-8 ビルドを使用するべきです。

source: Generating wxNavigationKeyEvent events doesn't work any more under wxGTK (and other platforms in the future), use wxWindow::Navigate() or NavigateIn() instead.
ja: wxGTK では (将来的には他のプラットフォームでも) wxNavigationKeyEvent イベントを生成しても動作しません。代わりに wxWindow::Navigate() か NavigateIn() を使用してください。

source: Generation is as simple as instancing your custom event class and initializing its internal fields.
ja: 生成はカスタムイベントのインスタンス化と内部変数の初期化と同じくらい単純です。

source: Generic Event Table Macros
ja: 汎用的なイベントテーブルマクロ

source: Generic event table macros
ja: 汎用的なイベントテーブルマクロ

source: Generic usage: an example
ja: 一般的な使用方法の例

source: Get the current font mapper object.
ja: 現在のフォントマッピングオブジェクトを取得します。

source: Get the picture?
ja: 分かりますか?

source: Gets all characters before the last occurrence of ch.
ja: ch が最後に登場した位置以前のすべての文字列を取得します。

source: Gets all the characters after the first occurrence of ch.
ja: ch が最初に登場した位置以降のすべての文字列を取得します。
